abstract class AppTexts {
  static const rules = '''1. کاربرد سرویس 
- اپلیکیشن آویز صرفاً برای مشاهده، ثبت و مدیریت آگهی‌های کاربران طراحی شده است.  
- هرگونه استفادهٔ غیرمجاز، فروش مجدد یا استخراج خودکار (scraping) محتوا خلاف قوانین است.

2. حقوق مالکیت معنوی  
- تمامی حقوق مربوط به نام، نشان تجاری و محتوای ارائه‌شده در اپلیکیشن برای شرکت آویز محفوظ است.  
- کاربران مجاز هستند تنها برای مصرف شخصی و غیرتجاری از محتوا استفاده کنند.

3. مسئولیت کاربران  
- اطلاعات وارد شده توسط کاربران باید دقیق و به‌روز باشد. هرگونه خسارت ناشی از اطلاعات نادرست بر عهدهٔ کاربر است.  
- کاربر موظف است از انتشار محتوای غیرقانونی، توهین‌آمیز یا مغایر با شئونات اخلاقی خودداری کند.

4. محرمانگی و حریم خصوصی  
- اطلاعات شخصی شما طبق «سیاست حفظ حریم خصوصی» نگهداری می‌شود.  
- بدون اجازهٔ صریح شما، داده‌ها به شخص ثالث منتقل نخواهد شد، مگر طبق حکم مراجع قانونی.

5. تغییرات در قوانین  
- شرکت آویز حق دارد در هر زمان این قوانین را به‌روز کند.  
- نسخهٔ جدید پس از انتشار در اپلیکیشن لازم‌الاجرا خواهد بود.

با استفاده از اپلیکیشن آویز، شما موافقت خود را با تمامی بندهای فوق اعلام می‌دارید.  ''';

  static const about =
      'آویز یک اپلیکیشن متن‌باز کاربردی برای مدیریت و اشتراک‌گذاری آگهی‌هاست که با استفاده از فریمورک فلاتر پیاده‌سازی شده است.'
      '\n'
      'شما می‌توانید کد کامل این پروژه را در گیت‌هاب مشاهده کنید. برای دسترسی به ریپازیتوری روی آیکون زیر کلیک نمایید.';
}
